In [9]:
# postgres_example.py
import psycopg2
from psycopg2 import sql

# --- Parámetros de conexión ---
# Asegúrate de que el contenedor Docker esté corriendo
DB_HOST = "localhost"
DB_PORT = "5432"
DB_NAME = "postgres"  # Base de datos por defecto
DB_USER = "postgres"  # Usuario por defecto
DB_PASS = "mysecretpassword" # La que pusiste en el comando docker run

In [10]:
conn = None

conn = psycopg2.connect(
        host=DB_HOST,
        port=DB_PORT,
        dbname=DB_NAME,
        user=DB_USER,
        password=DB_PASS
    )

print("Conexión a PostgreSQL exitosa!")

Conexión a PostgreSQL exitosa!

In [11]:
conn.autocommit = True
cursor = conn.cursor()

# 3. Ejecutar queries
# Limpieza previa (opcional)
cursor.execute("DROP TABLE IF EXISTS usuarios;")

# Crear tabla
create_table_query = """
CREATE TABLE usuarios (
    id SERIAL PRIMARY KEY,
    nombre VARCHAR(50) NOT NULL,
    email VARCHAR(50) UNIQUE NOT NULL
);
"""
cursor.execute(create_table_query)
print("Tabla 'usuarios' creada.")

# Insertar datos de forma segura para evitar inyección SQL
insert_query = "INSERT INTO usuarios (nombre, email) VALUES (%s, %s);"
usuarios_a_insertar = [
    ('Ana', 'ana@example.com'),
    ('Carlos', 'carlos@example.com')
]
cursor.executemany(insert_query, usuarios_a_insertar)
print(f"{cursor.rowcount} usuarios insertados.")

# 4. Consultar y obtener resultados
cursor.execute("SELECT id, nombre, email FROM usuarios ORDER BY nombre;")

print("\n--- Usuarios en la base de datos ---")
for row in cursor.fetchall():
    print(f"ID: {row[0]}, Nombre: {row[1]}, Email: {row[2]}")

Tabla 'usuarios' creada.
2 usuarios insertados.

--- Usuarios en la base de datos ---
ID: 1, Nombre: Ana, Email: ana@example.com
ID: 2, Nombre: Carlos, Email: carlos@example.com

In [14]:
#!pip install sqlalchemy

- URL de conexiones a base de datos
```
<protocolo>://<usuario>:<contraseña>@<host>:<puerto>/<nombre_base_datos>
```

In [16]:
from sqlalchemy import create_engine

churro = "postgresql://postgres:mysecretpassword@localhost:5432/postgres"
engine = create_engine(churro)

In [17]:
import pandas as pd

df = pd.read_sql("SELECT * FROM usuarios;", engine)
df.head()

   id  nombre               email
0   1     Ana     ana@example.com
1   2  Carlos  carlos@example.com

In [19]:
df = pd.DataFrame({
    'procucto': ['A', 'B', 'C'],
    'precio': [100, 150, 200]
})

df.head()

  procucto  precio
0        A     100
1        B     150
2        C     200

In [20]:
df.to_sql(name='productos', con=engine, if_exists='replace', index=False)

3

In [23]:
df = pd.read_sql("SELECT * FROM productos;", engine)
df.head()

  procucto  precio
0        A     100
1        B     150
2        C     200